// import content from "../../data/content.json";
import Image from "next/image";
import familyImg from "../../../public/images/family.jpg";
import vineyardImg from "../../../public/images/vineyard.jpg";

export default function Main() {
	return (
		// <main className="grid gap-10">
		// 	{content.cards.map((card, index) => (
		// 		<div
		// 			className={`${
		// 				index % 2 === 0 ? "justify-self-start" : "justify-self-end"
		// 			} flex flex-row w-[90%] items-center text-justify justify-between shadow-md rounded-xl p-4`}
		// 			key={index}
		// 		>
		// 			<p className="text-wrap ms-1 me-4">{card.text}</p>
		// 			{card.picture && (
		// 				<Image
		// 					className="rounded-md"
		// 					src={card.picture}
		// 					alt={card.picture}
		// 					width={350}
		// 					height={350}
		// 				/>
		// 			)}
		// 		</div>
		// 	))}
		// </main>
		<main className="mt-5 px-10 md:px-8 text-wrap text-justify flex flex-col items-center">
			<Image
				className="mb-5 w-80 md:w-96 rounded-xl shadow-2xl"
				src={familyImg}
				alt="argatia family"
			/>
			<p>
				Οι γονείς μας, Παναγιώτης Γεωργιάδης και Dr Χαρούλα Σπινθηροπούλου
				ένωσαν τις ικανότητες, την επαγγελματική τους εμπειρία, την αγάπη τους
				για την ποιοτική αμπελουργία και το σεβασμό τους στη μάνα γη και ίδρυσαν
				το 2000 την εταιρεία Γεωργιάδης- Σπινθηροπούλου Ο.Ε., με το διακριτικό
				τίτλο Αργατία*. Την ίδια χρονιά ξεκίνησε η εγκατάσταση των πρώτων μας
				αμπελώνων, η καλλιέργεια αποκλειστικά ελληνικών ποικιλιών και η παραγωγή
				κρασιών που ξεδιπλώνουν τον τόπο που παράγονται. Η βιολογική καλλιέργεια
				που εφαρμόζουμε πιστοποιείται από τη ΔΗΩ. Παράλληλα θέλοντας να
				συνεισφέρουν στην αγροτοτουριστική ανάπτυξη της περιοχής δημιούργησαν
				ένα επισκέψιμο οινοποιείο που προσελκύει ανθρώπους που αγαπούν το
				ποιοτικό κρασί, απ’ όλο τον κόσμο. Το 2018 εγώ, ο Χριστόφορος, ο μεγάλος
				τους γιος, και λίγα χρόνια αργότερα ο αδελφός μου Κωνσταντίνος,
				αναλαμβάνουμε τα ηνία της επιχείρησης συνεχίζοντας το όραμα των γονιών
				μας, με τον ίδιο σεβασμό, αγάπη και αφοσίωση στα υψηλής ποιότητας κρασιά
				μας και στον τόπο που αυτά παράγονται. *Η Αργατία (ή Αργατεία) αποτελεί
				έναν πολύ σημαντικό θεσμό της ποντιακής αγροτικής κοινωνίας, ο οποίος
				σύμφωνα με τον Σ. Ευσταθιάδη (1984) δημιουργείται και καθιερώνεται από
				την ανάγκη των πραγμάτων και λειτουργεί με διάφορους τρόπους ανάλογα με
				τους επιδιωκόμενους κάθε φορά σκοπούς. Ο θεσμός της Αργατίας θεωρείται
				ως η υπέρτατη εκδήλωση του συλλογικού πνεύματος στους ελληνικής
				καταγωγής πληθυσμούς του Πόντου, αφού προϋποθέτει τη συνεργασία προσώπων
				για την επίτευξη ενός κοινού σκοπού.
			</p>
			<Image
				className="mb-5 w-80 md:w-96 rounded-xl shadow-2xl"
				src={vineyardImg}
				alt="argatia's vineyard"
			/>
			<p>
				Αμπελώνες Οι αμπελώνες μας βρίσκονται εγκατεστημένοι σε τρεις περιοχές,
				την Κράσνα και τον Ξερόλακκο στο Ροδοχώρι και την Λάκκα στο
				Γιαννακοχώρι. Η Κράσνα βρίσκεται σε υψόμετρο 260 μ. Είναι μια περιοχή με
				ήπιο ανάγλυφο, ομαλές κλίσεις και αμμοαργιλώδη ως αργιλοπηλώδη εδάφη.
				Εδώ η εγκατάσταση των αμπελώνων ξεκίνησε το 2000, με τις ποικιλίες
				Ξινόμαυρο (κλώνος V6 και V3), Νεγκόσκα, Μαλαγουζιά και Ασύρτικο
				εμβολιασμένες στο υποκείμενο 1103 Paulsen, ενώ το 2019 φυτεύτηκε άλλος
				ένας αμπελώνας με Ασύρτικο στο ίδιο υποκείμενο. Η Λάκκα βρίσκεται λίγο
				χαμηλότερα σε υψόμετρο 250μ και περιλαμβάνει πιο ελαφρά αμμώδη ως
				αμμοπηλώδη εδάφη με λίγο ανθρακικό ασβέστιο . Η εγκατάσταση των
				αμπελώνων ξεκίνησε το 2008, αποκλειστικά με Ξινόμαυρο (κλώνος V6 και V3)
				εμβολιασμένο στο 1103 Paulsen. Τέλος ο νεότερος αμπελώνας μας βρίσκεται
				στην τοποθεσία Ξερόλακκος Ροδοχωρίου, σε υψόμετρο 550 μ., με έδαφος
				αμμοαργιλοπηλώδες με μέτριο ανθρακικό ασβέστιο. Φυτεύτηκε το 2020 με την
				ποικιλία Μαυροδάφνη εμβολιασμένη στο υποκείμενο 110R. Οι αμπελώνες
				καλλιεργούνται με βάση τις αρχές της βιολογικής γεωργίας από την αρχή
				της φύτευσής τους, και πιστοποιούνται από την ΔΗΩ. Στόχος όλων των
				εφαρμοζόμενων καλλιεργητικών τεχνικών είναι η απόκτηση φυτών μέτριας
				ζωηρότητας και ευρωστίας, αναγκαία συνθήκη για την παραγωγή κρασιών
				υψηλής ποιότητας.
			</p>
		</main>
	);
}
